Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services/care_in_your_community/dietician_clinical_nutritionists.html.txt.tmx
Source language: en
Languages: ga

source: A dietitian (also known as a clinical nutritionist) is a health professional who is qualified to give accurate advice and information on all aspects of nutrition and diet
ga: Gairmí sláinte atá i ndiaitéiteach (ar a dtugtar saineolaí cothaithe chomh maith) atá cáilithe le comhairle agus faisnéis chruinn a thabhairt maidir le gach gné den chothú agus den aiste bia

source: Dietitians apply knowledge of food, nutrition and other related disciplines such as biochemistry, physiology and social science to promote health, prevent disease and aid in the management of illness
ga: Cuireann diaitéitigh eolas ar bhia, cothú agus disciplíní gaolmhara eile i bhfeidhm, ar nós na bithcheimice, na físeolaíochta agus na heolaíochta sóisialta chun sláinte a chur chun cinn, galair a chosc agus cabhrú le tinneas a bhainistiú

source: You may see a dietitian in a hospital (as an inpatient or outpatient) or in the community (at a clinic or in a care centre)
ga: Féadfaidh tú casadh le diaitéiteach in ospidéal (mar othar cónaitheach nó seachtrach) nó sa phobal (ag clinic nó in ionad cúraim)

source: Dietetic services may be accessed on a public or private basis
ga: Féadtar seirbhísí diaitéiteacha a rochtain ar bhonn poiblí nó príobháideach

source: Dietitians are registered by CORU
ga: Bíonn diaitéiteach cláraithe ag CORU

source: Dietetic services are available free of charge through the public health service
ga: Bíonn seirbhísí diaitéiteacha ar fáil saor in aisce tríd an tseirbhís sláinte poiblí

source: However, availability may vary in different areas of the Health Service Executive (HSE)
ga: D’fhéadfadh an fháil a bhíonn orthu i gceantair éagsúla Fheidhmeannacht na Seirbhíse Sláinte (FSS) a bheith éagsúil, áfach

source: If you access services privately, you will be charged for the service
ga: Má fhaigheann tú rochtain ar sheirbhísí go príobháideach, gearrfar táille ort don tseirbhís

source: You may be able to reclaim costs if you have private health insurance
ga: D’fhéadfá bheith in ann costais a athéileamh má tá árachas sláinte príobháideach agat

source: You can be referred by a doctor, nurse or other health professional, or may be able to self refer
ga: Féadfaidh dochtúir, altra nó oibrí gairmiúil sláinte thú a atreorú, nó féadfaidh tú dul chucu tú féin

source: This depends on local policy and you should contact your Local Health Office or health centre for more information
ga: Braitheann seo ar an mbeartas áitiúil agus ba cheart duit dul i dteagmháil le d’Oifig Sláinte Áitiúil nó le d’ionad sláinte chun teacht ar bhreis faisnéise

source: You can check the CORU register to find a registered dietitian in your area
ga: Féadfaidh tú clár CORU a sheiceáil chun teacht ar dhiaitéiteach i do cheantar

source: The Irish Nutrition and Dietetic Institute is the professional organisation for dietitians in Ireland
ga: Is iad Institiúid Cothúcháin agus Diaitéitice na hÉireann an eagraíocht ghairmiúil do dhiaitéitigh in Éirinn

source: It provides a facility to 'Find a Dietitian' on its website
ga: Cuireann siad áis ‘Aimsigh Diaitéiteach’ ar fáil ar a láithreán gréasáin

source: Irish Nutrition and Dietetic Institute
ga: Institiúid Cothúcháin agus Diaitéitice na hÉireann
